"""
Не секрет, что некоторые программисты очень любят путешествовать.
Хорошо всем известный программист Петя тоже очень любит путешествовать,
посещать музеи и осматривать достопримечательности других городов.
Для перемещений между из города в город он предпочитает использовать машину.
При этом он заправляется только на станциях в городах, но не на станциях по пути.
Поэтому он очень аккуратно выбирает маршруты, чтобы машина не заглохла в дороге.
А ещё Петя очень важный член команды, поэтому он не может себе позволить путешествовать слишком долго.
Он решил написать программу, которая поможет ему с выбором очередного путешествия.
Но так как сейчас у него слишком много других задач, он попросил вас помочь ему.
Расстояние между двумя городами считается как сумма модулей разности по каждой из координат.
Дороги есть между всеми парами городов.

В первой строке входных данных записано количество городов n(2 <= n <= 1000).
В следующих n строках даны два целых числа: координаты каждого города, не превосходящие по модулю миллиарда.
Все города пронумерованы числами от 1 до n в порядке записи во входных данных.
В следующей строке записано целое положительное число k,
не превосходящее двух миллиардов, — максимальное расстояние между городами,
которое Петя может преодолеть без дозаправки машины.
В последней строке записаны два различных числа — номер города, откуда едет Петя,
и номер города, куда он едет.

Если существуют пути, удовлетворяющие описанным выше условиям, то выведите минимальное количество дорог,
которое нужно проехать, чтобы попасть из начальной точки маршрута в конечную.
Если пути не существует, выведите -1.
"""
import sys

amount = int(sys.stdin.readline())
cities = ''

while amount != 0:
    cities += sys.stdin.readline()
    amount -= 1

max_path = int(sys.stdin.readline())
from_to = sys.stdin.readline()


print(
    f'amount = {amount}, cities = {cities}, max_path = {max_path}, from_to = {from_to}'
)


def find_min_path():
    pass
